%2、4、6为成本型指标,其他为效益型指标
A=[46.5 56.0 42.7 29.8 35.6 27.6 33.4 41.5;
   36.8 51.0 46.5 45.6 49.5 70.4 35.4 35.7;
   62.1 48.7 52.6 46.8 42.9 54.7 42.9 26.4;
   50.0 33.5 29.8 26.7 18.6 57.1 38.2 52.6];
min_a=min(A);%求每一列的最小值
max_a=max(A);
deta_a=max_a-min_a;
B=zeros(4,8);
for i=1:size(A,1)
    for j=1:size(A,2)
        if(j==2||j==4||j==6)
           B(i,j)=(max_a(j)-A(i,j))/deta_a(j);
        else
           B(i,j)=(A(i,j)-min_a(j))/deta_a(j);
        end
    end
end
%规范化：https://blog.csdn.net/weixin_43184622/article/details/101445410
%对于效益性指标：不同方案同一指标的属性值中最大的那个为1，再在此基础上进行转化
%对于成本型指标：
